fixture/vcr_cassettes/transaction_lookup_surcharge_amount.json

[
  {
    "request": {
      "body": "cardNumber=4564710000000004&cardholderName=Xplor&cvn=847&expiryDateMonth=02&expiryDateYear=19&paymentMethod=creditCard",
      "headers": {
        "Accept": "application/json",
        "Content-Type": "application/x-www-form-urlencoded",
        "Idempotency-Key": "e1c4665c-5284-5b3f-8367-b773d6440fb4"
      },
      "method": "post",
      "options": {
        "recv_timeout": 10000,
        "basic_auth": "***"
      },
      "request_body": "",
      "url": "https://api.payway.com.au/rest/v1/single-use-tokens"
    },
    "response": {
      "body": "{\r\n  \"singleUseTokenId\" : \"7cce44ac-1a15-4971-99b1-03964d52e4b9\",\r\n  \"paymentMethod\" : \"creditCard\",\r\n  \"creditCard\" : {\r\n    \"maskedCardNumber\" : \"456471...004\",\r\n    \"cardScheme\" : \"visa\",\r\n    \"cardholderName\" : \"Xplor\",\r\n    \"surchargePercentage\" : 1.000\r\n  }\r\n}",
      "headers": {
        "Cache-Control": "no-store, no-cache, must-revalidate, proxy-revalidate",
        "Pragma": "no-cache",
        "Expires": "0",
        "Content-Type": "application/json;charset=UTF-8",
        "Content-Length": "266",
        "Date": "Mon, 30 Apr 2018 05:59:55 GMT",
        "Set-Cookie": "TS019af3e9=016fc1dd23eb2f9d5e043ea2cfd41b79df93b5e0ce478299afae5d9a6ff61ff7f92fdb69ff8f9d3b3b75aa177f9a874253f5dd356a; Path=/; Secure; HTTPOnly"
      },
      "status_code": 200,
      "type": "ok"
    }
  },
  {
    "request": {
      "body": "bankAccountId=TEST&merchantId=TEST&singleUseTokenId=7cce44ac-1a15-4971-99b1-03964d52e4b9",
      "headers": {
        "Accept": "application/json",
        "Content-Type": "application/x-www-form-urlencoded",
        "Idempotency-Key": "ab92f948-b627-5d14-b168-a1cdb61ff016"
      },
      "method": "post",
      "options": {
        "recv_timeout": 10000,
        "basic_auth": "***"
      },
      "request_body": "",
      "url": "https://api.payway.com.au/rest/v1/customers"
    },
    "response": {
      "body": "{\r\n  \"customerNumber\" : \"59000\",\r\n  \"paymentSetup\" : {\r\n    \"paymentMethod\" : \"creditCard\",\r\n    \"stopped\" : false,\r\n    \"creditCard\" : {\r\n      \"cardNumber\" : \"456471...004\",\r\n      \"expiryDateMonth\" : \"02\",\r\n      \"expiryDateYear\" : \"19\",\r\n      \"cardScheme\" : \"visa\",\r\n      \"cardholderName\" : \"Xplor\",\r\n      \"surchargePercentage\" : 1.0\r\n    },\r\n    \"merchant\" : {\r\n      \"merchantId\" : \"TEST\",\r\n      \"merchantName\" : \"Test Merchant\",\r\n      \"links\" : [ {\r\n        \"rel\" : \"self\",\r\n        \"href\" : \"https://api.payway.com.au/rest/v1/merchants/TEST\"\r\n      } ]\r\n    }\r\n  },\r\n  \"contact\" : {\r\n    \"customerName\" : \"Customer 59000\",\r\n    \"emailAddress\" : null,\r\n    \"sendEmailReceipts\" : false,\r\n    \"phoneNumber\" : null,\r\n    \"address\" : {\r\n      \"street1\" : null,\r\n      \"street2\" : null,\r\n      \"cityName\" : null,\r\n      \"state\" : null,\r\n      \"postalCode\" : null\r\n    }\r\n  },\r\n  \"customFields\" : { },\r\n  \"links\" : [ {\r\n    \"rel\" : \"self\",\r\n    \"href\" : \"https://api.payway.com.au/rest/v1/customers/59000\"\r\n  }, {\r\n    \"rel\" : \"help\",\r\n    \"href\" : \"https://www.payway.com.au/docs/rest.html#customers\"\r\n  }, {\r\n    \"rel\" : \"contact\",\r\n    \"href\" : \"https://api.payway.com.au/rest/v1/customers/59000/contact\"\r\n  }, {\r\n    \"rel\" : \"custom-fields\",\r\n    \"href\" : \"https://api.payway.com.au/rest/v1/customers/59000/custom-fields\"\r\n  }, {\r\n    \"rel\" : \"payment-setup\",\r\n    \"href\" : \"https://api.payway.com.au/rest/v1/customers/59000/payment-setup\"\r\n  }, {\r\n    \"rel\" : \"schedule\",\r\n    \"href\" : \"https://api.payway.com.au/rest/v1/customers/59000/schedule\"\r\n  }, {\r\n    \"rel\" : \"search-customer-transactions\",\r\n    \"href\" : \"https://api.payway.com.au/rest/v1/transactions/search-customer?customerNumber=59000\"\r\n  } ]\r\n}",
      "headers": {
        "Location": "https://api.payway.com.au/rest/v1/customers/59000",
        "Cache-Control": "no-store, no-cache, must-revalidate, proxy-revalidate",
        "Pragma": "no-cache",
        "Expires": "0",
        "Content-Type": "application/json;charset=UTF-8",
        "Content-Length": "1720",
        "Date": "Mon, 30 Apr 2018 05:59:56 GMT",
        "Set-Cookie": "TS019af3e9=016fc1dd2343bfab53b053a807fcfe85112f7d1ca0c34a97a1f55b49b655e53c3611c9a4fd34b40ca517cef6865a72140a03a43353; Path=/; Secure; HTTPOnly"
      },
      "status_code": 201,
      "type": "ok"
    }
  },
  {
    "request": {
      "body": "",
      "headers": {
        "Accept": "application/json"
      },
      "method": "get",
      "options": {
        "recv_timeout": 10000,
        "basic_auth": "***"
      },
      "request_body": "",
      "url": "https://api.payway.com.au/rest/v1/customers/59000/surcharge?principalAmount=1337.42"
    },
    "response": {
      "body": "{\r\n  \"principalAmount\" : 1337.42,\r\n  \"surchargeAmount\" : 13.37,\r\n  \"paymentAmount\" : 1350.79,\r\n  \"currencyCode\" : \"AUD\",\r\n  \"links\" : [ {\r\n    \"rel\" : \"help\",\r\n    \"href\" : \"https://www.payway.com.au/docs/rest.html#customers\"\r\n  } ]\r\n}",
      "headers": {
        "Cache-Control": "no-store, no-cache, must-revalidate, proxy-revalidate",
        "Pragma": "no-cache",
        "Expires": "0",
        "Content-Type": "application/json;charset=UTF-8",
        "Content-Length": "235",
        "Date": "Mon, 30 Apr 2018 05:59:57 GMT",
        "Set-Cookie": "TS019af3e9=016fc1dd23d285d635fd75ad95e64c0d31e507830e39dfddb197601d01dead028eca83b51fbb4fa2f3c974fdfa7bf13ddffce7c398; Path=/; Secure; HTTPOnly"
      },
      "status_code": 200,
      "type": "ok"
    }
  }
]